export const pressAboutUsItems = [
  {
    imgSrc: '/images/press-test-image.png',
    title: 'Сміх за рецептом: як лікарняна клоунеса працює з хворими дітками',
    text: 'У стінах нашої лікарні є особливий герой - лікарняна клоунеса, яка своїм сміхом і позитивом перетворює будні хворих діток на справжнє свято. Вона майстерно поєднує веселощі з підтримкою, допомагаючи маленьким пацієнтам відволіктися від болю і знайти надію навіть у найскладніші моменти. Завдяки її чарівним виступам діти забувають про лікарняні процедури і поринають у світ безтурботних веселощів. Її присутність наповнює палати теплом і світлом, створюючи атмосферу, де панує сміх і радість. Кожна зустріч з нею - це ковток свіжого повітря і заряд позитивних емоцій, які так потрібні для одужання...',
    link: 'https://www.platfor.ma/topic/smih-za-retseptom-yak-likarnyana-klounesa-pratsyuye-z-hvorymy-ditmy-v-ohmatdyti/',
    date: '08.06.2024',
  },
  {
    imgSrc: '/images/press-test-image.png',
    title: 'Сміх за рецептом: як лікарняна клоунеса працює з хворими дітками',
    text: 'У стінах нашої лікарні є особливий герой - лікарняна клоунеса, яка своїм сміхом і позитивом перетворює будні хворих діток на справжнє свято. Вона майстерно поєднує веселощі з підтримкою, допомагаючи маленьким пацієнтам відволіктися від болю і знайти надію навіть у найскладніші моменти.Завдяки її чарівним виступам діти забувають про лікарняні процедури і поринають у світ безтурботних веселощів. Її присутність наповнює палати теплом і світлом, створюючи атмосферу, де панує сміх і радість. Кожна зустріч з нею - це ковток свіжого повітря і заряд позитивних емоцій, які так потрібні для одужання...',
    link: 'https://www.platfor.ma/topic/smih-za-retseptom-yak-likarnyana-klounesa-pratsyuye-z-hvorymy-ditmy-v-ohmatdyti/',
    date: '08.06.2024',
  },
];
