export const blogItems = [
  {
    imgSrc: '/images/blog-test.png',
    title: 'Лікарняні клоуни: хто вони і чому це важливо?',
    text: 'На перший погляд, словосполучення “лікарняний клоун” достатньо незвичне і може викликати багато запитань. Адже, професія клоуна — це про радість та сміх, а лікарня — більше про проблеми зі здоров’ям, біль та страхи. Однак, саме завдяки лікарняним клоунам, важкохворі пацієнти, люди з інвалідністю, діти, які позбавлені батьківського піклування, можуть відволіктись, зняти напруження, прожити певні відчуття. Безумовно, це серйозна емоційна підтримка. Сьогодні ми детальніше розповімо про цю вкрай важливу місію',
    date: '08.06.2024',
  },
  {
    imgSrc: '/images/blog-test.png',
    title: 'Лікарняні клоуни: хто вони і чому це важливо?',
    text: 'На перший погляд, словосполучення “лікарняний клоун” достатньо незвичне і може викликати багато запитань. Адже, професія клоуна — це про радість та сміх, а лікарня — більше про проблеми зі здоров’ям, біль та страхи. Однак, саме завдяки лікарняним клоунам, важкохворі пацієнти, люди з інвалідністю, діти, які позбавлені батьківського піклування, можуть відволіктись, зняти напруження, прожити певні відчуття. Безумовно, це серйозна емоційна підтримка. Сьогодні ми детальніше розповімо про цю вкрай важливу місію',
    date: '08.06.2024',
  },
];
