'use client';

import React, { useState } from 'react';
import SectionTitle from '../shared/SectionTitle';
import { useTranslations } from 'next-intl';
import dynamic from 'next/dynamic';
import Image from 'next/image';

const Map = dynamic(() => import('./Map'), { ssr: false });

const initialAddress = "вулиця В'ячеслава Чорновола, 28/1, Київ, Україна, 01111";

const ContactsPage = () => {
  const t = useTranslations('Contacts');
  const [address, setAddress] = useState(initialAddress);
  const [isMapLoaded, setIsMapLoaded] = useState(false);

  return (
    <>
      <section
        className="bg-bgWhite bg-[right_top_35px] bg-no-repeat pb-[120px] pt-[100px]"
        style={{ backgroundImage: "url('/icons/school/wave.svg')" }}
      >
        <div className="container m-auto max-w-[1536px] items-center">
          <div className="flex flex-col md:flex-row justify-between">
            <div className="md:w-[calc(100%-746px)] flex flex-col space-y-4 justify-center relative">
              <SectionTitle title={t('title')} />
              <div className="flex items-center">
                <span className="material-icons">
                  <svg width="22" height="28" viewBox="0 0 22 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M10.9999 14C11.7333 14 12.3613 13.7391 12.8839 13.2173C13.4066 12.6956 13.6675 12.0676 13.6666 11.3333C13.6657 10.5991 13.4048 9.97155 12.8839 9.45066C12.363 8.92978 11.735 8.66844 10.9999 8.66666C10.2648 8.66489 9.63725 8.92622 9.11725 9.45066C8.59725 9.97511 8.33592 10.6027 8.33325 11.3333C8.33059 12.064 8.59192 12.692 9.11725 13.2173C9.64259 13.7427 10.2701 14.0036 10.9999 14ZM10.9999 27.3333C7.42214 24.2889 4.75014 21.4613 2.98392 18.8507C1.2177 16.24 0.334141 13.8231 0.333252 11.6C0.333252 8.26666 1.4057 5.61111 3.55059 3.63333C5.69547 1.65555 8.17859 0.666664 10.9999 0.666664C13.8213 0.666664 16.3048 1.65555 18.4506 3.63333C20.5964 5.61111 21.6684 8.26666 21.6666 11.6C21.6666 13.8222 20.7835 16.2391 19.0173 18.8507C17.251 21.4622 14.5786 24.2898 10.9999 27.3333Z" fill="#50439F"/>
                  </svg>
                </span>
                <p className="ml-6">{address}</p>
              </div>
              <div className="flex items-center">
                <span className="material-icons">
                  <svg width="24" height="20" viewBox="0 0 24 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M4 0C2.93913 0 1.92172 0.421427 1.17157 1.17157C0.421427 1.92172 0 2.93913 0 4V4.402L12 10.864L24 4.404V4C24 2.93913 23.5786 1.92172 22.8284 1.17157C22.0783 0.421427 21.0609 0 20 0H4ZM24 6.674L12.474 12.88C12.3283 12.9584 12.1655 12.9995 12 12.9995C11.8345 12.9995 11.6717 12.9584 11.526 12.88L0 6.674V16C0 17.0609 0.421427 18.0783 1.17157 18.8284C1.92172 19.5786 2.93913 20 4 20H20C21.0609 20 22.0783 19.5786 22.8284 18.8284C23.5786 18.0783 24 17.0609 24 16V6.674Z" fill="#50439F"/>
                  </svg>
                </span>
                <p className="ml-6"><a href="mailto:bulkina.ola@gmail.com">bulkina.ola@gmail.com</a></p>
              </div>
              <div className="flex items-center">
                <span className="material-icons">
                  <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M24.675 4.19375L21.3469 0.86875C21.1121 0.632949 20.8331 0.445856 20.5258 0.31822C20.2185 0.190584 19.889 0.12492 19.5563 0.125C18.8781 0.125 18.2406 0.390625 17.7625 0.86875L14.1813 4.45C13.9454 4.68477 13.7584 4.96382 13.6307 5.27111C13.5031 5.5784 13.4374 5.90788 13.4375 6.24063C13.4375 6.91875 13.7031 7.55625 14.1813 8.03438L16.8 10.6531C16.187 12.0043 15.3348 13.2334 14.2844 14.2812C13.2366 15.3342 12.0076 16.1896 10.6563 16.8062L8.0375 14.1875C7.80273 13.9517 7.52369 13.7646 7.21639 13.637C6.9091 13.5093 6.57962 13.4437 6.24688 13.4438C5.56875 13.4438 4.93125 13.7094 4.45313 14.1875L0.868752 17.7656C0.632675 18.0008 0.44543 18.2804 0.317789 18.5882C0.190149 18.8961 0.12463 19.2261 0.125002 19.5594C0.125002 20.2375 0.390627 20.875 0.868752 21.3531L4.19063 24.675C4.95313 25.4406 6.00625 25.875 7.0875 25.875C7.31563 25.875 7.53438 25.8563 7.75 25.8188C11.9625 25.125 16.1406 22.8844 19.5125 19.5156C22.8813 16.15 25.1188 11.975 25.8219 7.75C26.0344 6.45937 25.6063 5.13125 24.675 4.19375Z" fill="#50439F"/>
                  </svg>
                </span>
                <p className="ml-6">+380 67 596 1600</p>
              </div>
              <div className="flex items-center">
                <span className="material-icons">
                  <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.0001 8.83472C10.7064 8.83472 8.83452 10.7066 8.83452 13.0003C8.83452 15.2941 10.7064 17.166 13.0001 17.166C15.2939 17.166 17.1658 15.2941 17.1658 13.0003C17.1658 10.7066 15.2939 8.83472 13.0001 8.83472ZM25.4939 13.0003C25.4939 11.2753 25.5095 9.56597 25.4126 7.84409C25.3158 5.84409 24.8595 4.06909 23.397 2.60659C21.9314 1.14097 20.1595 0.687844 18.1595 0.590969C16.4345 0.494094 14.7251 0.509719 13.0033 0.509719C11.2783 0.509719 9.5689 0.494094 7.84702 0.590969C5.84702 0.687844 4.07202 1.14409 2.60952 2.60659C1.1439 4.07222 0.690773 5.84409 0.593898 7.84409C0.497023 9.56909 0.512648 11.2785 0.512648 13.0003C0.512648 14.7222 0.497023 16.4347 0.593898 18.1566C0.690773 20.1566 1.14702 21.9316 2.60952 23.3941C4.07515 24.8597 5.84702 25.3128 7.84702 25.4097C9.57202 25.5066 11.2814 25.491 13.0033 25.491C14.7283 25.491 16.4376 25.5066 18.1595 25.4097C20.1595 25.3128 21.9345 24.8566 23.397 23.3941C24.8626 21.9285 25.3158 20.1566 25.4126 18.1566C25.5126 16.4347 25.4939 14.7253 25.4939 13.0003ZM13.0001 19.4097C9.45327 19.4097 6.59077 16.5472 6.59077 13.0003C6.59077 9.45347 9.45327 6.59097 13.0001 6.59097C16.547 6.59097 19.4095 9.45347 19.4095 13.0003C19.4095 16.5472 16.547 19.4097 13.0001 19.4097ZM19.672 7.82534C18.8439 7.82534 18.1751 7.15659 18.1751 6.32847C18.1751 5.50034 18.8439 4.83159 19.672 4.83159C20.5001 4.83159 21.1689 5.50034 21.1689 6.32847C21.1691 6.52511 21.1306 6.71987 21.0555 6.90159C20.9803 7.08331 20.8701 7.24842 20.731 7.38747C20.592 7.52652 20.4269 7.63677 20.2451 7.7119C20.0634 7.78704 19.8687 7.82559 19.672 7.82534Z" fill="#50439F"/>
                  </svg>
                </span>
                <p className="ml-6"><a href="https://instagram.com/boop.ukraine" target="_blank">boop.ukraine</a></p>
              </div>
              <div className="flex items-center">
                <span className="material-icons">
                  <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M27.3337 14.0003C27.3337 6.64033 21.3603 0.666992 14.0003 0.666992C6.64033 0.666992 0.666992 6.64033 0.666992 14.0003C0.666992 20.4537 5.25366 25.827 11.3337 27.067V18.0003H8.66699V14.0003H11.3337V10.667C11.3337 8.09366 13.427 6.00033 16.0003 6.00033H19.3337V10.0003H16.667C15.9337 10.0003 15.3337 10.6003 15.3337 11.3337V14.0003H19.3337V18.0003H15.3337V27.267C22.067 26.6003 27.3337 20.9203 27.3337 14.0003Z" fill="#50439F"/>
                  </svg>
                </span>
                <p className="ml-6"><a href="https://facebook.com/Boop.ukraine/" target="_blank">facebook.com/Boop.ukraine</a></p>
              </div>
              <Image
                src="/images/blue-clown.svg"
                alt="Clown"
                width={251}
                height={185}
                className="absolute right-0 -bottom-[90px]"
              />
            </div>
            <div className="md:w-[746px] mt-4 md:mt-0">
              {isMapLoaded ? (
                <Map initialAddress={address} onAddressChange={setAddress} />
              ) : (
                <div style={{ width: '100%', height: '400px', display: 'flex', alignItems: 'center', justifyContent: 'center', backgroundColor: '#e0e0e0' }}>
                  <p>Loading map...</p>
                </div>
              )}
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default ContactsPage;
